app/views/favorites/_favorite-btn.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
  <i class="fas fa-heart text-success"></i>
    <%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
  <i class="fas fa-heart text-danger"></i>
    <%= book.favorites.count %> いいね