app/views/books/show.html.erb

              <i class="fas fa-heart text-success"></i>
                <%= @books.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

            <div class="comments">
              <p>コメント件数：<%= @books.book_comments.count %></p>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]